Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40004108" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2SC1_TPR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000410C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2SC1_TCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004110" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2SC1_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004114" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2SC1_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004118" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2SC1_TNPR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:desc="Transmit Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000411C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2SC1_TNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:desc="Transmit Counter Next" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004120" edc:access="-------w----wwww------ww------ww" edc:cname="I2SC1_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004124" edc:access="-------r-----r-r-------r-------r" edc:cname="I2SC1_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40004128" edc:offset="0x3ED8"/>
      <edc:SFRDef edc:_addr="0x40008000" edc:access="------------------------------nn" edc:cname="FLEXCOM5_MR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="FLEXCOM5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM5">
            <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="FLEXCOM Operating Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_COM" edc:desc="No communication" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="USART" edc:desc="All related USART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,)All SPI/TWI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="SPI operating mode is selected.All USART/TWI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TWI" edc:desc="All related TWI protocols are selected (TWI, SMBUS). All USART/SPI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
