Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x4000C218" edc:access="----------------r------rrrrrrrrr" edc:cname="US_RHR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:desc="Received Sync" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C21C" edc:access="----------------w------wwwwwwwww" edc:cname="US_THR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:desc="Character to be Transmitted" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:desc="Sync Field to be Transmitted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C220" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:cname="US_BRGR" edc:impl="0x7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="CD" edc:desc="Clock Divider" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FP" edc:desc="Fractional Part" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C224" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:cname="US_RTOR" edc:impl="0x1FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="TO" edc:desc="Time-out Value" edc:nzwidth="0x11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C228" edc:access="------------------------nnnnnnnn" edc:cname="US_TTGR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="TG" edc:desc="Timeguard Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000C22C" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x4000C240" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_FIDI" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="FI_DI_RATIO" edc:desc="FI Over DI Ratio Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C244" edc:access="------------------------rrrrrrrr" edc:cname="US_NER" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="NB_ERRORS" edc:desc="Number of Errors" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000C248" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4000C24C" edc:access="------------------------nnnnnnnn" edc:cname="US_IF" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:desc="IrDA Filter" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000C250" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4000C254" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:cname="US_LINMR" edc:impl="0x3FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="NACT" edc:desc="LIN Node Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:desc="Parity Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:desc="Checksum Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:desc="Checksum Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:desc="Data Length Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:desc="Frame Slot Mode Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:desc="Wakeup Signal Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:desc="Data Length Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:desc="PDC Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:desc="Synchronization Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C258" edc:access="------------------------nnnnnnnn" edc:cname="US_LINIR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:desc="Identifier Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
