Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40018630" edc:access="------------------------rrrrrrrr" edc:cname="TWI3_RHR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="RXDATA" edc:desc="Master or Slave Receive Holding Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018634" edc:access="------------------------wwwwwwww" edc:cname="TWI3_THR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:desc="Master or Slave Transmit Holding Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018638" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn----nnnn" edc:cname="TWI3_SMBTR" edc:impl="0xFFFFFF0F" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="PRESC" edc:desc="SMBus Clock Prescaler" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TLOWS" edc:desc="Slave Clock Stretch Maximum Cycles" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="TLOWM" edc:desc="Master Clock Stretch Maximum Cycles" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="THMAX" edc:desc="Clock High Maximum Cycles" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001863C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40018640" edc:access="------nnnnnnnnnn------nnnnnnnnnn" edc:cname="TWI3_ACR" edc:impl="0x3FF03FF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="DATAL" edc:desc="Data Length" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Transfer Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEC" edc:desc="PEC Request (SMBus Mode only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="NDATAL" edc:desc="Next Data Length" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NDIR" edc:desc="Next Transfer Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NPEC" edc:desc="Next PEC Request (SMBus Mode only)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018644" edc:access="---------------------nnn-----nnn" edc:cname="TWI3_FILTR" edc:impl="0x707" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="FILT" edc:desc="RX Digital Filter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADFEN" edc:desc="PAD Filter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADFCFG" edc:desc="PAD Filter Config" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="THRES" edc:desc="Digital Filter Threshold" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40018648" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4001864C" edc:access="nnnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="TWI3_SWMR" edc:impl="0xFF7F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="SADR1" edc:desc="Slave Address 1" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR2" edc:desc="Slave Address 2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR3" edc:desc="Slave Address 3" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAM" edc:desc="Data Match" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40018650" edc:offset="0x94"/>
      <edc:SFRDef edc:_addr="0x400186E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TWI3_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x545749"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400186E8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr-------r" edc:cname="TWI3_WPSR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400186EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40018700" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI3_RPR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:desc="Receive Pointer Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018704" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TWI3_RCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:desc="Receive Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018708" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI3_TPR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001870C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TWI3_TCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018710" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI3_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018714" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TWI3_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI3">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
