Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x4001C2E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="US_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001C2EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x4001C300" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_RPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:desc="Receive Pointer Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C304" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_RCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:desc="Receive Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C308" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_TPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C30C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_TCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C310" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C314" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C318" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_TNPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:desc="Transmit Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C31C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_TNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:desc="Transmit Counter Next" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C320" edc:access="-------w----wwww------ww------ww" edc:cname="US_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C324" edc:access="-------r-----r-r-------r-------r" edc:cname="US_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="USART4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART4">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001C328" edc:offset="0xD8"/>
      <edc:SFRDef edc:_addr="0x4001C400" edc:access="-------w-----------w----w-----ww" edc:cname="SPI4_CR" edc:impl="0x1001083" edc:nzwidth="0x20" ltx:memberofperipheral="SPI4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI4">
            <edc:SFRFieldDef edc:cname="SPIEN" edc:desc="SPI Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIDIS" edc:desc="SPI Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="SPI Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:desc="Request to Clear the Comparison Trigger" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:desc="Last Transfer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C404" edc:access="nnnnnnnn------nn---n----n-nnnnnn" edc:cname="SPI4_MR" edc:impl="0xFF0310BF" edc:nzwidth="0x20" ltx:memberofperipheral="SPI4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI4">
            <edc:SFRFieldDef edc:cname="MSTR" edc:desc="Master/Slave Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PS" edc:desc="Peripheral Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCSDEC" edc:desc="Chip Select Decode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSRCCLK" edc:desc="Bit Rate Source Clock" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source clock for the bit rate generation." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PMC_PCK" edc:desc="PMC PCKx is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MODFDIS" edc:desc="Mode Fault Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:desc="Wait Data Read Before Transfer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LLB" edc:desc="Local Loopback Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:desc="Comparison Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception of all incoming characters until REQCLR is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:desc="Peripheral Chip Select" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DLYBCS" edc:desc="Delay Between Chip Selects" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
