Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:AdjustPoint edc:_addr="0x40024004" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40024010" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="FLEXCOM2_RHR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="FLEXCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="RXDATA" edc:desc="Receive Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024014" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40024020" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="FLEXCOM2_THR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="FLEXCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:desc="Transmit Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024024" edc:offset="0x1DC"/>
      <edc:SFRDef edc:_addr="0x40024200" edc:access="---w------wwww--wwwwwwwwwwwwww--" edc:cname="US_CR" edc:impl="0x103CFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:desc="Reset Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:desc="Reset Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:desc="Reset Status Bits" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTBRK" edc:desc="Start Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STPBRK" edc:desc="Stop Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTTO" edc:desc="Clear TIMEOUT Flag and Start Time-out After Next Character Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SENDA" edc:desc="Send Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIT" edc:desc="Reset Iterations" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTNACK" edc:desc="Reset Non Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RETTO" edc:desc="Start Time-out Immediately" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RTSEN" edc:desc="Request to Send Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTSDIS" edc:desc="Request to Send Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINABT" edc:desc="Abort LIN Transmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINWKUP" edc:desc="Send LIN Wakeup Signal" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:desc="Request to Clear the Comparison Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024204" edc:access="---n-nnnn-nnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_MR" edc:impl="0x17BFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="USART_MODE" edc:desc="USART Mode of Operation" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RS485" edc:desc="RS485 mode" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HW_HANDSHAKING" edc:desc="Hardware Handshaking" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_0" edc:desc="IS07816 Protocol: T = 0" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_1" edc:desc="IS07816 Protocol: T = 1" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="IRDA" edc:desc="IrDA mode" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="LIN_MASTER" edc:desc="LIN master mode" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="LIN_SLAVE" edc:desc="LIN Slave mode" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI master mode" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI Slave mode" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USCLKS" edc:desc="Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Peripheral clock divided (DIV=8) is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PMC_PCK" edc:desc="PMC programmable clock (PCK) is selected.If the SCK pin is driven (CLKO=1), the CD field must be greater than 1." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="External pin (SCK) is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHRL" edc:desc="Character Length" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_5_BIT" edc:desc="Character length is 5 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_6_BIT" edc:desc="Character length is 6 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_7_BIT" edc:desc="Character length is 7 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="Character length is 8 bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchronous Mode Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:desc="Parity Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even parity" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd parity" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Parity forced to 0 (Space)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Parity forced to 1 (Mark)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MULTIDROP" edc:desc="Multidrop mode" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSTOP" edc:desc="Number of Stop Bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BIT" edc:desc="1 stop bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_5_BIT" edc:desc="1.5 stop bits (SYNC = 0) or reserved (SYNC = 1)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BIT" edc:desc="2 stop bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:desc="Channel Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic Echo. Receiver input is connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local Loopback. Transmitter output is connected to the Receiver Input." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote Loopback. RXD pin is internally connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MSBF" edc:desc="Bit Order" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE9" edc:desc="9-bit Character Length" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKO" edc:desc="Clock Output Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVER" edc:desc="Oversampling Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INACK" edc:desc="Inhibit Non Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSNACK" edc:desc="Disable Successive NACK" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INVDATA" edc:desc="Inverted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAX_ITERATION" edc:desc="Maximum Number of Automatic Iteration" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Receive Line Filter" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024208" edc:access="---------w--w-----wwwwwwwwwwwwww" edc:cname="US_IER" edc:impl="0x483FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Enable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max number of Repetitions Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Comparison Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002420C" edc:access="---------w--w-----wwwwwwwwwwwwww" edc:cname="US_IDR" edc:impl="0x483FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Disable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-out Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max Number of Repetitions Reached Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Comparison Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024210" edc:access="---------r--r-----rrrrrrrrrrrrrr" edc:cname="US_IMR" edc:impl="0x483FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Mask (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Mask (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-out Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max Number of Repetitions Reached Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Mask (available in all USART modes of operation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Comparison Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
