Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40024214" edc:access="--------rr--r-----rrrrrrrrrrrrrr" edc:cname="US_CSR" edc:impl="0xC83FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready (cleared by reading US_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmitter Ready (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received/End of Break (cleared by writing a one to the bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of RX Buffer (cleared by writing US_RCR or US_RNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of TX Buffer (cleared by writing US_TCR or US_TNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared by writing a one to the bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error (cleared by writing a one to the bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error (cleared by writing a one to the US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Receiver Time-out (cleared by writing a one to the bit US_CR.STTTO)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmitter Empty (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max Number of Repetitions Reached (cleared by writing a one to the bit US_CR.RSTIT)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="TX Buffer Empty (cleared by writing US_TCR or US_TNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="RX Buffer Full (cleared by writing US_RCR or US_RNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt (cleared by writing a one to the bit US_CR.RSTNACK)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Comparison Status (cleared by writing a one to the bit US_CR.RSTSTA command)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:desc="Image of CTS Input" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024218" edc:access="----------------r------rrrrrrrrr" edc:cname="US_RHR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:desc="Received Sync" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002421C" edc:access="----------------w------wwwwwwwww" edc:cname="US_THR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:desc="Character to be Transmitted" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:desc="Sync Field to be Transmitted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024220" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:cname="US_BRGR" edc:impl="0x7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="CD" edc:desc="Clock Divider" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FP" edc:desc="Fractional Part" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024224" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:cname="US_RTOR" edc:impl="0x1FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="TO" edc:desc="Time-out Value" edc:nzwidth="0x11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024228" edc:access="------------------------nnnnnnnn" edc:cname="US_TTGR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="TG" edc:desc="Timeguard Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002422C" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40024240" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_FIDI" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="FI_DI_RATIO" edc:desc="FI Over DI Ratio Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024244" edc:access="------------------------rrrrrrrr" edc:cname="US_NER" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="NB_ERRORS" edc:desc="Number of Errors" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024248" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4002424C" edc:access="------------------------nnnnnnnn" edc:cname="US_IF" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:desc="IrDA Filter" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024250" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40024254" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:cname="US_LINMR" edc:impl="0x3FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="NACT" edc:desc="LIN Node Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:desc="Parity Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:desc="Checksum Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:desc="Checksum Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:desc="Data Length Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:desc="Frame Slot Mode Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:desc="Wakeup Signal Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:desc="Data Length Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:desc="PDC Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:desc="Synchronization Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024258" edc:access="------------------------nnnnnnnn" edc:cname="US_LINIR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:desc="Identifier Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002425C" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:cname="US_LINBRR" edc:impl="0x7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="LINCD" edc:desc="Clock Divider after Synchronization" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="LINFP" edc:desc="Fractional Part after Synchronization" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024260" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x40024290" edc:access="-------nnnnnnnnn-n-n---nnnnnnnnn" edc:cname="US_CMPR" edc:impl="0x1FF51FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="VAL1" edc:desc="First Comparison Value for Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:desc="Comparison Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception of all incoming charactersuntil REQCLR is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPPAR" edc:desc="Compare Parity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:desc="Second Comparison Value for Received Character" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024294" edc:offset="0x50"/>
      <edc:SFRDef edc:_addr="0x400242E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="US_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x555341"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400242E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="US_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400242EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40024300" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_RPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:desc="Receive Pointer Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024304" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_RCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:desc="Receive Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024308" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_TPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002430C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_TCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024310" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
