Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40024604" edc:access="---------nnnnnnn---n--nn--------" edc:cname="TWI2_MMR" edc:impl="0x7F1300" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="IADRSZ" edc:desc="Internal Device Address Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No internal device address" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BYTE" edc:desc="One-byte internal device address" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BYTE" edc:desc="Two-byte internal device address" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BYTE" edc:desc="Three-byte internal device address" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MREAD" edc:desc="Master Read Direction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DADR" edc:desc="Device Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024608" edc:access="nnnn-----nnnnnnn-nnnnnnn-n--nn-n" edc:cname="TWI2_SMR" edc:impl="0xF07F7F4D" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="NACKEN" edc:desc="Slave Receiver Data Phase NACK Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMDA" edc:desc="SMBus Default Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMHH" edc:desc="SMBus Host Header" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCLWSDIS" edc:desc="Clock Wait State Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Slave Address Mask" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR" edc:desc="Slave Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SADR1EN" edc:desc="Slave Address 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR2EN" edc:desc="Slave Address 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR3EN" edc:desc="Slave Address 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAMEN" edc:desc="Data Matching Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002460C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI2_IADR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="IADR" edc:desc="Internal Address" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024610" edc:access="---nnnnn---n-nnnnnnnnnnnnnnnnnnn" edc:cname="TWI2_CWGR" edc:impl="0x1F17FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="CLDIV" edc:desc="Clock Low Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CHDIV" edc:desc="Clock High Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:desc="Clock Divider" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSRCCLK" edc:desc="Bit Rate Source Clock" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source clock for the bit rate generation." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PCK" edc:desc="Programmable clock is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:desc="TWD Hold Time Versus TWCK Falling" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024614" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40024620" edc:access="------rrr-rrrr-rrrrrrrrrrrrrrrrr" edc:cname="TWI2_SR" edc:impl="0x3BDFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed (cleared by writing TWI_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready (cleared when reading TWI_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready (cleared by writing TWI_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVREAD" edc:desc="Slave Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledged (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLWS" edc:desc="Clock Wait State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="TWI Lock due to Frame Errors" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL" edc:desc="SCL line value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDA" edc:desc="SDA line value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024624" edc:access="----------wwww-wwwwwwwwwwwww-www" edc:cname="TWI2_IER" edc:impl="0x3DFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024628" edc:access="----------wwww-wwwwwwwwwwwww-www" edc:cname="TWI2_IDR" edc:impl="0x3DFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
