Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40024704" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TWI2_RCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:desc="Receive Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024708" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI2_TPR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002470C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TWI2_TCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024710" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI2_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024714" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TWI2_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024718" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWI2_TNPR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:desc="Transmit Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002471C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TWI2_TNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:desc="Transmit Counter Next" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024720" edc:access="-------w----wwww------ww------ww" edc:cname="TWI2_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024724" edc:access="-------r-----r-r-------r-------r" edc:cname="TWI2_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="TWI2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI2">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40024728" edc:offset="0x38D8"/>
      <edc:SFRDef edc:_addr="0x40028000" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MEM2MEM_THR" edc:nzwidth="0x20" ltx:memberofperipheral="MEM2MEM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="THDATA" edc:desc="Transfer Holding Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
