Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40028124" edc:access="-------r-----r-r-------r-------r" edc:cname="MEM2MEM_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="MEM2MEM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40028128" edc:offset="0x3ED8"/>
      <edc:SFRDef edc:_addr="0x4002C000" edc:access="---------------------------n---n" edc:cname="PDMIC0_CR" edc:impl="0x11" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ENPDM" edc:desc="Enable PDM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C004" edc:access="-----------------nnnnnnn---n----" edc:cname="PDMIC0_MR" edc:impl="0x7F10" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CLKS" edc:desc="Clock Source Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PRESCAL" edc:desc="Prescaler Rate Selection" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C008" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4002C014" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PDMIC0_CDR" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Converted" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C018" edc:access="---ww-ww------------------------" edc:cname="PDMIC0_IER" edc:impl="0x1B000000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C01C" edc:access="---ww-ww------------------------" edc:cname="PDMIC0_IDR" edc:impl="0x1B000000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="General Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C020" edc:access="---rr-rr------------------------" edc:cname="PDMIC0_IMR" edc:impl="0x1B000000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="General Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C024" edc:access="---rr-rrrrrrrrrr----------------" edc:cname="PDMIC0_ISR" edc:impl="0x1BFF0000" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="FIFOCNT" edc:desc="FIFO Count" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of RX Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="RX Buffer Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C028" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x4002C058" edc:access="----------------nnnnnnnn-nnnnnn-" edc:cname="PDMIC0_DSPR0" edc:impl="0xFF7E" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HPFBYP" edc:desc="High-Pass Filter Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SINBYP" edc:desc="SINCC Filter Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Data Size" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:desc="Oversampling Ratio" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="Oversampling ratio is 128" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="Oversampling ratio is 64" edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCALE" edc:desc="Data Scale" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SHIFT" edc:desc="Data Shift" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C05C" edc:access="nnnnnnnnnnnnnnnn-nnnnnnnnnnnnnnn" edc:cname="PDMIC0_DSPR1" edc:impl="0xFFFF7FFF" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:SFRFieldDef edc:cname="DGAIN" edc:desc="Gain Correction" edc:nzwidth="0xF"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OFST" edc:desc="Offset Correction" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C060" edc:offset="0x84"/>
      <edc:SFRDef edc:_addr="0x4002C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PDMIC0_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
