Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40038104" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ADC_RCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:desc="Receive Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038108" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038110" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038114" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ADC_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038118" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038120" edc:access="-------w----wwww------ww------ww" edc:cname="ADC_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038124" edc:access="-------r-----r-r-------r-------r" edc:cname="ADC_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038128" edc:offset="0x3ED8"/>
      <edc:SFRDef edc:_addr="0x4003C000" edc:access="------------------rrrrrrrrrrrrrr" edc:cname="CMCC_TYPE" edc:impl="0x3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access Port Access Allowed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK" edc:desc="Dynamic Clock Gating Supported" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RANDP" edc:desc="Random Selection Policy Supported" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRUP" edc:desc="Least Recently Used Policy Supported" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RRP" edc:desc="Random Selection Policy Supported" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAYNUM" edc:desc="Number of Ways" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DMAPPED" edc:desc="Direct Mapped Cache" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ARCH2WAY" edc:desc="2-way set associative" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ARCH4WAY" edc:desc="4-way set associative" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ARCH8WAY" edc:desc="8-way set associative" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LCKDOWN" edc:desc="Lockdown Supported" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:desc="Data Cache Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CSIZE_1KB" edc:desc="Data cache size is 1 Kbyte" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_2KB" edc:desc="Data cache size is 2 Kbytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_4KB" edc:desc="Data cache size is 4 Kbytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_8KB" edc:desc="Data cache size is 8 Kbytes" edc:when="(field &amp; 0x7) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLSIZE" edc:desc="Cache LIne Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLSIZE_1KB" edc:desc="Cache line size is 4 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_2KB" edc:desc="Cache line size is 8 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_4KB" edc:desc="Cache line size is 16 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_8KB" edc:desc="Cache line size is 32 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
