Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x4003C004" edc:access="-------------------------nnn-nnn" edc:cname="CMCC_CFG" edc:impl="0x77" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="GCLKDIS" edc:desc="Disable Clock Gating" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRGCSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C008" edc:access="-------------------------------w" edc:cname="CMCC_CTRL" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Cache Controller Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C00C" edc:access="-------------------------------r" edc:cname="CMCC_SR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="CSTS" edc:desc="Cache Controller Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C010" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x4003C020" edc:access="-------------------------------w" edc:cname="CMCC_MAINT0" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="INVALL" edc:desc="Cache Controller Invalidate All" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C024" edc:access="ww---------------------wwwww----" edc:cname="CMCC_MAINT1" edc:impl="0xC00001F0" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="INDEX" edc:desc="Invalidate Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="WAY" edc:desc="Invalidate Way" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="WAY0" edc:desc="Way 0 is selection for index invalidation" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAY1" edc:desc="Way 1 is selection for index invalidation" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WAY2" edc:desc="Way 2 is selection for index invalidation" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="WAY3" edc:desc="Way 3 is selection for index invalidation" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C028" edc:access="------------------------------nn" edc:cname="CMCC_MCFG" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Cache Controller Monitor Counter Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CYCLE_COUNT" edc:desc="Cycle counter" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IHIT_COUNT" edc:desc="Instruction hit counter" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DHIT_COUNT" edc:desc="Data hit counter" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C02C" edc:access="-------------------------------n" edc:cname="CMCC_MEN" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="MENABLE" edc:desc="Cache Controller Monitor Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C030" edc:access="-------------------------------w" edc:cname="CMCC_MCTRL" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Monitor" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C034" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CMCC_MSR" edc:nzwidth="0x20" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="EVENT_CNT" edc:desc="Monitor Event Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C038" edc:offset="0x3FC8"/>
      <edc:SFRDef edc:_addr="0x40040000" edc:access="------------------------------nn" edc:cname="FLEXCOM6_MR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="FLEXCOM6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="FLEXCOM Operating Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_COM" edc:desc="No communication" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="USART" edc:desc="All related USART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,)All SPI/TWI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="SPI operating mode is selected.All USART/TWI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TWI" edc:desc="All related TWI protocols are selected (TWI, SMBUS). All USART/SPI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040004" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40040010" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="FLEXCOM6_RHR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="FLEXCOM6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="RXDATA" edc:desc="Receive Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040014" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40040020" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="FLEXCOM6_THR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="FLEXCOM6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:desc="Transmit Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
