Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:AdjustPoint edc:_addr="0x40040248" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4004024C" edc:access="------------------------nnnnnnnn" edc:cname="US_IF" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART6">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:desc="IrDA Filter" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040250" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40040254" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:cname="US_LINMR" edc:impl="0x3FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART6">
            <edc:SFRFieldDef edc:cname="NACT" edc:desc="LIN Node Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:desc="Parity Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:desc="Checksum Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:desc="Checksum Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:desc="Data Length Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:desc="Frame Slot Mode Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:desc="Wakeup Signal Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:desc="Data Length Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:desc="PDC Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:desc="Synchronization Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040258" edc:access="------------------------nnnnnnnn" edc:cname="US_LINIR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART6">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:desc="Identifier Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004025C" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:cname="US_LINBRR" edc:impl="0x7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART6">
            <edc:SFRFieldDef edc:cname="LINCD" edc:desc="Clock Divider after Synchronization" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="LINFP" edc:desc="Fractional Part after Synchronization" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040260" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x40040290" edc:access="-------nnnnnnnnn-n-n---nnnnnnnnn" edc:cname="US_CMPR" edc:impl="0x1FF51FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART6">
            <edc:SFRFieldDef edc:cname="VAL1" edc:desc="First Comparison Value for Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:desc="Comparison Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception of all incoming charactersuntil REQCLR is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPPAR" edc:desc="Compare Parity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:desc="Second Comparison Value for Received Character" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040294" edc:offset="0x50"/>
      <edc:SFRDef edc:_addr="0x400402E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="US_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="USART6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART6">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x555341"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400402E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="US_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="USART6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART6">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
