Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:AdjustPoint edc:_addr="0x40040420" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40040430" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI6_CSR0" edc:nzwidth="0x20" ltx:memberofperipheral="SPI6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI6">
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:desc="Chip Select Active After Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:desc="Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:desc="Serial Clock Bit Rate" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:desc="Delay Before SPCK" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040434" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI6_CSR1" edc:nzwidth="0x20" ltx:memberofperipheral="SPI6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI6">
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:desc="Chip Select Active After Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:desc="Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:desc="Serial Clock Bit Rate" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:desc="Delay Before SPCK" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040438" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40040448" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI6_CMPR" edc:nzwidth="0x20" ltx:memberofperipheral="SPI6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI6">
            <edc:SFRFieldDef edc:cname="VAL1" edc:desc="First Comparison Value for Received Character" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:desc="Second Comparison Value for Received Character" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004044C" edc:offset="0x98"/>
      <edc:SFRDef edc:_addr="0x400404E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="SPI6_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="SPI6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI6">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x535049"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400404E8" edc:access="----------------rrrrrrrr-------r" edc:cname="SPI6_WPSR" edc:impl="0xFF01" edc:nzwidth="0x20" ltx:memberofperipheral="SPI6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI6">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
