Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40040720" edc:access="-------w----wwww------ww------ww" edc:cname="TWI6_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="TWI6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI6">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040724" edc:access="-------r-----r-r-------r-------r" edc:cname="TWI6_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="TWI6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI6">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40040728" edc:offset="0x38D8"/>
      <edc:SFRDef edc:_addr="0x40044000" edc:access="--------------rr-----rrrrrrrrrrr" edc:cname="UDP_FRM_NUM" edc:impl="0x307FF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FRM_NUM" edc:desc="Frame Number as Defined in the Packet Field Formats" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FRM_ERR" edc:desc="Frame Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRM_OK" edc:desc="Frame OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044004" edc:access="---------------------------nnnnn" edc:cname="UDP_GLB_STAT" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FADDEN" edc:desc="Function Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CONFG" edc:desc="Configured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESR" edc:desc="Enable Send Resume" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMINPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RMWUPE" edc:desc="Remote Wakeup Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044008" edc:access="-----------------------n-nnnnnnn" edc:cname="UDP_FADDR" edc:impl="0x17F" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FADD" edc:desc="Function Address Value" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FEN" edc:desc="Function Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004400C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40044010" edc:access="------------------w-wwww--wwwwww" edc:cname="UDP_IER" edc:impl="0x2F3F" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:desc="Enable Endpoint 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:desc="Enable Endpoint 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:desc="Enable Endpoint 2Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:desc="Enable Endpoint 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:desc="Enable Endpoint 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:desc="Enable Endpoint 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:desc="Enable UDP Suspend Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:desc="Enable UDP Resume Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:desc="Enable Start Of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Enable UDP Bus Wakeup Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044014" edc:access="------------------w-wwww--wwwwww" edc:cname="UDP_IDR" edc:impl="0x2F3F" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:desc="Disable Endpoint 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:desc="Disable Endpoint 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:desc="Disable Endpoint 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:desc="Disable Endpoint 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:desc="Disable Endpoint 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:desc="Disable Endpoint 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:desc="Disable UDP Suspend Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:desc="Disable UDP Resume Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:desc="Disable Start Of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Disable USB Bus Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044018" edc:access="------------------rrrrrr--rrrrrr" edc:cname="UDP_IMR" edc:impl="0x3F3F" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:desc="Mask Endpoint 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:desc="Mask Endpoint 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:desc="Mask Endpoint 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:desc="Mask Endpoint 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:desc="Mask Endpoint 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:desc="Mask Endpoint 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:desc="Mask UDP Suspend Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:desc="Mask UDP Resume Interrupt." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:desc="Mask Start Of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BIT12" edc:desc="UDP_IMR Bit 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="USB Bus Wakeup Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004401C" edc:access="------------------rrrrrr--rrrrrr" edc:cname="UDP_ISR" edc:impl="0x3F3F" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:desc="Endpoint 0 Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:desc="Endpoint 1 Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:desc="Endpoint 2 Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:desc="Endpoint 3 Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:desc="Endpoint 4 Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:desc="Endpoint 5 Interrupt Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:desc="UDP Suspend Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:desc="UDP Resume Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:desc="Start of Frame Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDBUSRES" edc:desc="End of BUS Reset Interrupt Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="UDP Resume Interrupt Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044020" edc:access="------------------wwwwww--------" edc:cname="UDP_ICR" edc:impl="0x3F00" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:desc="Clear UDP Suspend Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:desc="Clear UDP Resume Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:desc="Clear Start Of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDBUSRES" edc:desc="Clear End of Bus Reset Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Clear Wakeup Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044024" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40044028" edc:access="--------------------------nnnnnn" edc:cname="UDP_RST_EP" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0" edc:desc="Reset Endpoint 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP1" edc:desc="Reset Endpoint 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP2" edc:desc="Reset Endpoint 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP3" edc:desc="Reset Endpoint 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP4" edc:desc="Reset Endpoint 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP5" edc:desc="Reset Endpoint 5" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004402C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40044030" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:cname="UDP_CSR0" edc:impl="0x7FF8FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Generates an IN Packet with Data Previously Written in the DPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:desc="Receive Data Bank 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:desc="Received Setup" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:desc="Stall Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="Transmit Packet Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type (Read/Write)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:desc="Data Toggle (Read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:desc="Endpoint Enable Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:desc="Number of Bytes Available in the FIFO (Read-only)" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044034" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:cname="UDP_CSR1" edc:impl="0x7FF8FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Generates an IN Packet with Data Previously Written in the DPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:desc="Receive Data Bank 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:desc="Received Setup" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:desc="Stall Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="Transmit Packet Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type (Read/Write)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:desc="Data Toggle (Read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:desc="Endpoint Enable Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:desc="Number of Bytes Available in the FIFO (Read-only)" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044038" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:cname="UDP_CSR2" edc:impl="0x7FF8FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Generates an IN Packet with Data Previously Written in the DPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:desc="Receive Data Bank 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:desc="Received Setup" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:desc="Stall Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="Transmit Packet Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type (Read/Write)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:desc="Data Toggle (Read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:desc="Endpoint Enable Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:desc="Number of Bytes Available in the FIFO (Read-only)" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
