Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x4004403C" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:cname="UDP_CSR3" edc:impl="0x7FF8FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Generates an IN Packet with Data Previously Written in the DPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:desc="Receive Data Bank 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:desc="Received Setup" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:desc="Stall Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="Transmit Packet Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type (Read/Write)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:desc="Data Toggle (Read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:desc="Endpoint Enable Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:desc="Number of Bytes Available in the FIFO (Read-only)" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044040" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:cname="UDP_CSR4" edc:impl="0x7FF8FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Generates an IN Packet with Data Previously Written in the DPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:desc="Receive Data Bank 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:desc="Received Setup" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:desc="Stall Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="Transmit Packet Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type (Read/Write)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:desc="Data Toggle (Read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:desc="Endpoint Enable Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:desc="Number of Bytes Available in the FIFO (Read-only)" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044044" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:cname="UDP_CSR5" edc:impl="0x7FF8FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Generates an IN Packet with Data Previously Written in the DPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:desc="Receive Data Bank 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:desc="Received Setup" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:desc="Stall Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="Transmit Packet Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type (Read/Write)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:desc="Data Toggle (Read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:desc="Endpoint Enable Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:desc="Number of Bytes Available in the FIFO (Read-only)" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044048" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40044050" edc:access="------------------------nnnnnnnn" edc:cname="UDP_FDR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:desc="FIFO Data Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044054" edc:access="------------------------nnnnnnnn" edc:cname="UDP_FDR1" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:desc="FIFO Data Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
