Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x40044058" edc:access="------------------------nnnnnnnn" edc:cname="UDP_FDR2" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:desc="FIFO Data Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004405C" edc:access="------------------------nnnnnnnn" edc:cname="UDP_FDR3" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:desc="FIFO Data Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044060" edc:access="------------------------nnnnnnnn" edc:cname="UDP_FDR4" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:desc="FIFO Data Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044064" edc:access="------------------------nnnnnnnn" edc:cname="UDP_FDR5" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:desc="FIFO Data Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044068" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40044074" edc:access="----------------------nn--------" edc:cname="UDP_TXVC" edc:impl="0x300" edc:nzwidth="0x20" ltx:memberofperipheral="UDP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TXVDIS" edc:desc="Transceiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUON" edc:desc="Pull-up On" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044078" edc:offset="0x3F88"/>
      <edc:SFRDef edc:_addr="0x40048000" edc:access="nnnnnnnnnnnnnnnnnnnnnnn---------" edc:cname="CRCCU_DSCR" edc:impl="0xFFFFFE00" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="DSCR" edc:desc="Descriptor Base Address" edc:nzwidth="0x17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40048004" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40048008" edc:access="-------------------------------w" edc:cname="CRCCU_DMA_EN" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="DMA Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004800C" edc:access="-------------------------------w" edc:cname="CRCCU_DMA_DIS" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMADIS" edc:desc="DMA Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048010" edc:access="-------------------------------r" edc:cname="CRCCU_DMA_SR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMASR" edc:desc="DMA Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048014" edc:access="-------------------------------w" edc:cname="CRCCU_DMA_IER" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIER" edc:desc="Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048018" edc:access="-------------------------------w" edc:cname="CRCCU_DMA_IDR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIDR" edc:desc="Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004801C" edc:access="-------------------------------r" edc:cname="CRCCU_DMA_IMR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIMR" edc:desc="Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048020" edc:access="-------------------------------r" edc:cname="CRCCU_DMA_ISR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAISR" edc:desc="Interrupt Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
