Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:AdjustPoint edc:_addr="0x40048024" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40048034" edc:access="-------------------------------w" edc:cname="CRCCU_CR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="RESET" edc:desc="CRC Computation Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048038" edc:access="--------------n---------nnnnnnnn" edc:cname="CRCCU_MR" edc:impl="0x200FF" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="CRC Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPARE" edc:desc="CRC Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:desc="Primitive Polynomial" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CCITT8023" edc:desc="Polynom 0x04C11DB7" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CASTAGNOLI" edc:desc="Polynom 0x1EDC6F41" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CCITT16" edc:desc="Polynom 0x1021" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVIDER" edc:desc="Request Divider" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BITORDER" edc:desc="Precomputation Bit Swap Operation of the CRC" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MSBFIRST" edc:desc="CRC computation is performed from the most significant bit to the least significant bit" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LSBFIRST" edc:desc="CRC computation is performed from the least significant bit to the most significant bit" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004803C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CRCCU_SR" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="CRC" edc:desc="Cyclic Redundancy Check Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048040" edc:access="-------------------------------w" edc:cname="CRCCU_IER" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIER" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048044" edc:access="-------------------------------w" edc:cname="CRCCU_IDR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIDR" edc:desc="CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048048" edc:access="-------------------------------r" edc:cname="CRCCU_IMR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIMR" edc:desc="CRC Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004804C" edc:access="-------------------------------r" edc:cname="CRCCU_ISR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="CRCCU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRISR" edc:desc="CRC Error Interrupt Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40048050" edc:offset="0x3FB0"/>
      <edc:SFRDef edc:_addr="0x4004C000" edc:access="------------------------rrrrrrrr" edc:cname="UHP_HCREVISION" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="REV" edc:desc="OHCI revision number" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C004" edc:access="---------------------nnnnnnnnnnn" edc:cname="UHP_HCCONTROL" edc:impl="0x7FF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="CBSR" edc:desc="Control/bulk service ratio" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PLE" edc:desc="Periodic list enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="Isochronous enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLE" edc:desc="Control list enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLE" edc:desc="Bulk list enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCFS" edc:desc="Host controller functional state" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IR" edc:desc="Interrupt routing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Remote wake-up connected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWE" edc:desc="Remote wake-up enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
