Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x4004C008" edc:access="--------------nn------------nnnn" edc:cname="UHP_HCCOMMANDSTATUS" edc:impl="0x3000F" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="HCR" edc:desc="Host controller reset (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLF" edc:desc="Control list filled (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLF" edc:desc="Bulk list filled (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCR" edc:desc="Ownership change request (read/write)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="SOC" edc:desc="Scheduling overrun count (read-only)" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C00C" edc:access="-n-----------------------nnnnnnn" edc:cname="UHP_HCINTERRUPTSTATUS" edc:impl="0x4000007F" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="SO" edc:desc="Scheduling overrun (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDH" edc:desc="Write done head (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SF" edc:desc="Start of frame (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD" edc:desc="Resume detected (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UE" edc:desc="Unrecoverable error (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FNO" edc:desc="Frame number overflow (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RHSC" edc:desc="Root hub status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="OC" edc:desc="Ownership change (read-only)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C010" edc:access="nn-----------------------nnnnnnn" edc:cname="UHP_HCINTERRUPTENABLE" edc:impl="0xC000007F" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="SO" edc:desc="Scheduling overrun (read/write, write '1' to set)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDH" edc:desc="Write done head (read/write, write '1' to set)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SF" edc:desc="Start of frame (read/write, write '1' to set)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD" edc:desc="Resume detected (read/write, write '1' to set)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UE" edc:desc="Unrecoverable error (read/write, write '1' to set)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FNO" edc:desc="Frame number overflow (read/write, write '1' to set)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RHSC" edc:desc="Root hub status change (read/write, write '1' to set)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="OC" edc:desc="Ownership change (read-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIE" edc:desc="Master interrupt enable (read/write, write '1' to set)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C014" edc:access="nn-----------------------nnnnnnn" edc:cname="UHP_HCINTERRUPTDISABLE" edc:impl="0xC000007F" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="SO" edc:desc="Scheduling overrun (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDH" edc:desc="Write done head (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SF" edc:desc="Start of frame (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD" edc:desc="Resume detected (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UE" edc:desc="Unrecoverable error (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FNO" edc:desc="Frame number overflow (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RHSC" edc:desc="Root hub status change (read/write)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="OC" edc:desc="Ownership change (read-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIE" edc:desc="Master interrupt enable (read/write)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C018" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn--------" edc:cname="UHP_HCHCCA" edc:impl="0xFFFFFF00" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="HCCA" edc:desc="Physical address of the beginning of the HCCA" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C01C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrr----" edc:cname="UHP_HCPERIODCURRENTED" edc:impl="0xFFFFFFF0" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCED" edc:desc="Physical address of the current ED on the periodic ED list" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
