Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x4004C020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn----" edc:cname="UHP_HCCONTROLHEADED" edc:impl="0xFFFFFFF0" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CHED" edc:desc="Physical address of the head ED on the control ED list" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C024" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn----" edc:cname="UHP_HCCONTROLCURRENTED" edc:impl="0xFFFFFFF0" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CCED" edc:desc="Physical address of the current ED on the control ED list" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C028" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn----" edc:cname="UHP_HCBULKHEADED" edc:impl="0xFFFFFFF0" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="BHED" edc:desc="Physical address of the head ED on the bulk ED list" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C02C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn----" edc:cname="UHP_HCBULKCURRENTED" edc:impl="0xFFFFFFF0" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="BCED" edc:desc="Physical address of the current ED on the bulk ED list" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C030" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrr----" edc:cname="UHP_HCDONEHEAD" edc:impl="0xFFFFFFF0" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DH" edc:desc="Physical address of the last TD that has added to the done queue" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C034" edc:access="nnnnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="UHP_HCFMINTERVAL" edc:impl="0xFFFF3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="FRAMEINTERVAL" edc:desc="Frame interval" edc:nzwidth="0xE"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FSMPS" edc:desc="Largest data packet" edc:nzwidth="0xF"/>
            <edc:SFRFieldDef edc:cname="FIT" edc:desc="Frame interval toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C038" edc:access="r-----------------rrrrrrrrrrrrrr" edc:cname="UHP_HCFMREMAINING" edc:impl="0x80003FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="FR" edc:desc="Frame remaining" edc:nzwidth="0xE"/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="FRT" edc:desc="Frame remaining toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C03C" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="UHP_HCFMNUMBER" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="FN" edc:desc="Frame number" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C040" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="UHP_HCPERIODICSTART" edc:impl="0x3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="PS" edc:desc="Periodic start" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C044" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="UHP_HCLSTHRESHOLD" edc:impl="0x3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="LST" edc:desc="Low-speed threshold" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C048" edc:access="nnnnnnnn-----------nnnnnnnnnnnnn" edc:cname="UHP_HCRHDESCRIPTORA" edc:impl="0xFF001FFF" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="NDP" edc:desc="Number of downstream ports (read-only)" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PSM" edc:desc="Power switching mode (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NPS" edc:desc="No power switching (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DT" edc:desc="Device type (read-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCPM" edc:desc="Overcurrent protection mode (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOCP" edc:desc="No overcurrent protection (read/write)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="POTPG" edc:desc="Power-on to power-good time (read/write)" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
