Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x4004C04C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UHP_HCRHDESCRIPTORB" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="DR0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DR15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPCM15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C050" edc:access="n-------------nnn-------------nn" edc:cname="UHP_HCRHSTATUS" edc:impl="0x80038003" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="LPS" edc:desc="Local power status (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCI" edc:desc="Overcurrent indicator (read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="DRWE" edc:desc="Device remote wake-up enable (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPSC" edc:desc="Local power status change (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCIC" edc:desc="Overcurrent indication change (read/write)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="CRWE" edc:desc="Clear remote wake-up enable (read/write)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C054" edc:access="-----------nnnnn------nn---nnnnn" edc:cname="UHP_HCRHPORTSTATUS0" edc:impl="0x1F031F" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="CCS_CPE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PES_SPE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PSS_SPS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POCI_CSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRS_SPR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PPS_SPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSDA_CPP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CSC" edc:desc="Port 1 connect status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PESC" edc:desc="Port 1 enable status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PSSC" edc:desc="Port 1 suspend status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCIC" edc:desc="Port 1 overcurrent indicator change (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRSC" edc:desc="Port 1 reset status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C058" edc:access="-----------nnnnn------nn---nnnnn" edc:cname="UHP_HCRHPORTSTATUS1" edc:impl="0x1F031F" edc:nzwidth="0x20" ltx:memberofperipheral="UHP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UHP">
            <edc:SFRFieldDef edc:cname="CCS_CPE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PES_SPE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PSS_SPS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POCI_CSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRS_SPR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PPS_SPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSDA_CPP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CSC" edc:desc="Port 1 connect status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PESC" edc:desc="Port 1 enable status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PSSC" edc:desc="Port 1 suspend status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCIC" edc:desc="Port 1 overcurrent indicator change (read/write)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRSC" edc:desc="Port 1 reset status change (read/write, write '1' to clear)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004C05C" edc:offset="0x941A4"/>
      <edc:SFRDef edc:_addr="0x400E0200" edc:access="-----------------------------nnn" edc:cname="MATRIX_MCFG0" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="UNLIMITED" edc:desc="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_BEAT" edc:desc="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BEAT" edc:desc="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BEAT" edc:desc="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0204" edc:access="-----------------------------nnn" edc:cname="MATRIX_MCFG1" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="UNLIMITED" edc:desc="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_BEAT" edc:desc="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BEAT" edc:desc="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BEAT" edc:desc="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0208" edc:access="-----------------------------nnn" edc:cname="MATRIX_MCFG2" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="UNLIMITED" edc:desc="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_BEAT" edc:desc="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BEAT" edc:desc="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BEAT" edc:desc="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E020C" edc:offset="0x34"/>
      <edc:SFRDef edc:_addr="0x400E0240" edc:access="-----------nnnnn--------nnnnnnnn" edc:cname="MATRIX_SCFG0" edc:impl="0x1F00FF" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Default Master" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0244" edc:access="-----------nnnnn--------nnnnnnnn" edc:cname="MATRIX_SCFG1" edc:impl="0x1F00FF" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Default Master" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0248" edc:access="-----------nnnnn--------nnnnnnnn" edc:cname="MATRIX_SCFG2" edc:impl="0x1F00FF" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Default Master" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E024C" edc:access="-----------nnnnn--------nnnnnnnn" edc:cname="MATRIX_SCFG3" edc:impl="0x1F00FF" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Default Master" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0250" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x400E0280" edc:access="------------------nn--nn--nn--nn" edc:cname="MATRIX_PRAS0" edc:impl="0x3333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
