Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:AdjustPoint edc:_addr="0x400E0284" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0288" edc:access="------------------nn--nn--nn--nn" edc:cname="MATRIX_PRAS1" edc:impl="0x3333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E028C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0290" edc:access="------------------nn--nn--nn--nn" edc:cname="MATRIX_PRAS2" edc:impl="0x3333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0294" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0298" edc:access="------------------nn--nn--nn--nn" edc:cname="MATRIX_PRAS3" edc:impl="0x3333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E029C" edc:offset="0x78"/>
      <edc:SFRDef edc:_addr="0x400E0314" edc:access="-------------------nnn--nnnn----" edc:cname="CCFG_SYSIO" edc:impl="0x1CF0" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO4" edc:desc="PB4 or TDI Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO5" edc:desc="PB5 or TDO/TRACESWO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO6" edc:desc="PB6 or TMS/SWDIO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO7" edc:desc="PB7 or TCK/SWCLK Assignment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SYSIO10" edc:desc="PA21 or DM Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO11" edc:desc="PA22 or DP Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO12" edc:desc="PB12 or ERASE Assignment" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0318" edc:access="-----------------------------nnn" edc:cname="CCFG_DYNCKG" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="MATCKG" edc:desc="MATRIX Dynamic Clock Gating" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRIDCKG" edc:desc="Bridge Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFCCKG" edc:desc="EFC Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E031C" edc:access="------------------------------nn" edc:cname="CCFG_I2SCLKSEL" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="CLKSEL0" edc:desc="I2S0 Clock Source" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL1" edc:desc="I2S1 Clock Source" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0320" edc:access="-----------------------------nnn" edc:cname="CCFG_USBMR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="USBMODE" edc:desc="USB Mode Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBHTSSC" edc:desc="USB Transceiver Suspend Software Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBHTSC" edc:desc="USB Host Transceiver Suspend Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0324" edc:offset="0xC0"/>
      <edc:SFRDef edc:_addr="0x400E03E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="MATRIX_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x4D4154"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E03E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="MATRIX_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E03EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E0400" edc:access="----------------wwwwwwwwww------" edc:cname="PMC_SCER" edc:impl="0xFFC0" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UHP" edc:desc="USB Host Port Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDP" edc:desc="USB Device Port Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:desc="Programmable Clock 7 Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0404" edc:access="----------------wwwwwwwwww------" edc:cname="PMC_SCDR" edc:impl="0xFFC0" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UHP" edc:desc="USB Host Port Clock Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:desc="Programmable Clock 7 Output Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
