Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x400E0424" edc:access="-----------n---nnnnnnnnnnnnnnnnn" edc:cname="CKGR_MCFR" edc:impl="0x11FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MAINF" edc:desc="Main Clock Frequency" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="MAINFRDY" edc:desc="Main Clock Frequency Measure Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RCMEAS" edc:desc="RC Oscillator Frequency Measure (write-only)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0428" edc:access="--nnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="CKGR_PLLAR" edc:impl="0x3FFF3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLAEN" edc:desc="PLLA Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PLLACOUNT" edc:desc="PLLA Counter" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MULA" edc:desc="PLLA Multiplier" edc:nzwidth="0xD"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:desc="Must Be Written to 0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E042C" edc:access="--n--nnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="CKGR_PLLBR" edc:impl="0x27FF3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLBEN" edc:desc="PLLB Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PLLBCOUNT" edc:desc="PLLB Counter" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MULB" edc:desc="PLLB Multiplier" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:desc="Must Be Written to 0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0430" edc:access="------------------nn-----nnn--nn" edc:cname="PMC_MCKR" edc:impl="0x3073" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLBClock is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Processor Clock Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_3" edc:desc="Selected clock divided by 3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLLADIV2" edc:desc="PLLA Divisor by 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLLBDIV2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0434" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0438" edc:access="--------------------nnnn-------n" edc:cname="PMC_USB" edc:impl="0xF01" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="USBS" edc:desc="USB Input Clock Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="USBDIV" edc:desc="Divider for USB Clock" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E043C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0440" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK0" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
