Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x400E0444" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK1" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0448" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK2" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E044C" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK3" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0450" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK4" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0454" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK5" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0458" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK6" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
