Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x400E045C" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK7" edc:impl="0xFF7" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0460" edc:access="-------------wwwwwwwwwww----wwww" edc:cname="PMC_IER" edc:impl="0x7FF0F" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:desc="PLLB Lock Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:desc="Programmable Clock Ready 7 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0464" edc:access="-------------wwwwwwwwwww----wwww" edc:cname="PMC_IDR" edc:impl="0x7FF0F" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:desc="PLLB Lock Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:desc="Programmable Clock Ready 7 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0468" edc:access="-----------rrrrrrrrrrrrrr---rrrr" edc:cname="PMC_SR" edc:impl="0x1FFF8F" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:desc="PLLB Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:desc="Slow Clock Oscillator Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:desc="Clock Failure Detector Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:desc="Clock Failure Detector Fault Output Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E046C" edc:access="-------------rrrrrrrrrrr----rrrr" edc:cname="PMC_IMR" edc:impl="0x7FF0F" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:desc="PLLB Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:desc="Programmable Clock Ready 7 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0470" edc:access="--------nnnn-nnnnnnnnnnnnnnnnnnn" edc:cname="PMC_FSMR" edc:impl="0xF7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTT0" edc:desc="Fast Startup Input Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT1" edc:desc="Fast Startup Input Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT2" edc:desc="Fast Startup Input Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT3" edc:desc="Fast Startup Input Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT4" edc:desc="Fast Startup Input Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT5" edc:desc="Fast Startup Input Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT6" edc:desc="Fast Startup Input Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT7" edc:desc="Fast Startup Input Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT8" edc:desc="Fast Startup Input Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT9" edc:desc="Fast Startup Input Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT10" edc:desc="Fast Startup Input Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT11" edc:desc="Fast Startup Input Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT12" edc:desc="Fast Startup Input Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT13" edc:desc="Fast Startup Input Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT14" edc:desc="Fast Startup Input Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT15" edc:desc="Fast Startup Input Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:desc="RTT Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:desc="RTC Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBAL" edc:desc="USB Alarm Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:desc="Low-power Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:desc="Flash Low-power Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-power-down mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FFLPM" edc:desc="Force Flash Low-power Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0474" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMC_FSPR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTP0" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP1" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP2" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP3" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP4" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP5" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP6" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP7" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP8" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP9" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP10" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP11" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP12" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP13" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP14" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP15" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0478" edc:access="-------------------------------w" edc:cname="PMC_FOCR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:desc="Fault Output Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
