Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:AdjustPoint edc:_addr="0x400E047C" edc:offset="0x68"/>
      <edc:SFRDef edc:_addr="0x400E04E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PMC_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E04E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="PMC_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E04EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E0500" edc:access="--------------www---------------" edc:cname="PMC_PCER1" edc:impl="0x38000" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral Clock 47 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral Clock 48 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral Clock 49 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0504" edc:access="--------------www---------------" edc:cname="PMC_PCDR1" edc:impl="0x38000" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral Clock 47 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral Clock 48 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral Clock 49 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0508" edc:access="--------------rrr---------------" edc:cname="PMC_PCSR1" edc:impl="0x38000" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral Clock 47 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral Clock 48 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral Clock 49 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E050C" edc:access="---n----------nn---n------nnnnnn" edc:cname="PMC_PCR" edc:impl="0x1003103F" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Peripheral ID" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Divisor Value" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PERIPH_DIV_MCK" edc:desc="Peripheral clock is MCK" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PERIPH_DIV2_MCK" edc:desc="Peripheral clock is MCK/2" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PERIPH_DIV4_MCK" edc:desc="Peripheral clock is MCK/4" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PERIPH_DIV8_MCK" edc:desc="Peripheral clock is MCK/8" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0510" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMC_OCR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CAL8" edc:desc="RC Oscillator Calibration bits for 8 MHz" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SEL8" edc:desc="Selection of RC Oscillator Calibration bits for 8 MHz" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL16" edc:desc="RC Oscillator Calibration bits for 16 MHz" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SEL16" edc:desc="Selection of RC Oscillator Calibration bits for 16 MHz" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL24" edc:desc="RC Oscillator Calibration bits for 24 MHz" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SEL24" edc:desc="Selection of RC Oscillator Calibration bits for 24 MHz" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0514" edc:access="--wwwwwwwwwwwwwwwwwwwwww--------" edc:cname="PMC_SLPWK_ER0" edc:impl="0x3FFFFF00" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral 8 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral 9 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral 10 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral 11 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral 12 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral 13 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral 14 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral 15 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral 16 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral 17 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral 18 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral 19 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral 20 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral 21 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral 22 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral 23 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral 24 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral 25 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral 26 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral 27 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral 28 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral 29 SleepWalking Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0518" edc:access="--wwwwwwwwwwwwwwwwwwwwww--------" edc:cname="PMC_SLPWK_DR0" edc:impl="0x3FFFFF00" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral 8 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral 9 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral 10 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral 11 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral 12 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral 13 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral 14 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral 15 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral 16 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral 17 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral 18 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral 19 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral 20 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral 21 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral 22 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral 23 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral 24 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral 25 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral 26 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral 27 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral 28 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral 29 SleepWalking Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E051C" edc:access="--rrrrrrrrrrrrrrrrrrrrrr--------" edc:cname="PMC_SLPWK_SR0" edc:impl="0x3FFFFF00" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral 8 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral 9 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral 10 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral 11 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral 12 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral 13 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral 14 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral 15 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral 16 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral 17 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral 18 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral 19 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral 20 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral 21 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral 22 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral 23 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral 24 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral 25 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral 26 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral 27 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral 28 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral 29 SleepWalking Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0520" edc:access="--rrrrrrrrrrrrrrrrrrrrrr--------" edc:cname="PMC_SLPWK_ASR0" edc:impl="0x3FFFFF00" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral 8 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral 9 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral 10 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral 11 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral 12 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral 13 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral 14 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral 15 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral 16 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral 17 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral 18 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral 19 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral 20 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral 21 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral 22 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral 23 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral 24 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral 25 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral 26 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral 27 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral 28 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral 29 Activity Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0524" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400E0530" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="PMC_PMMR" edc:impl="0x7FF07FF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLA_MMAX" edc:desc="PLLA Maximum Allowed Multiplier Value" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLLB_MMAX" edc:desc="PLLB Maximum Allowed Multiplier Value" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
