Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x400E1418" edc:access="nnnnnnnnnnnn-----nnn------------" edc:cname="SUPC_MR" edc:impl="0xFFF07000" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="BODRSTEN" edc:desc="POR Core Reset Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal vddcore_nreset is asserted when a brownout detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODDIS" edc:desc="POR Core Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core brownout detector is enabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The core brownout detector is disabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ONE" edc:desc="This bit must always be set to 1." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="OSCBYPASS" edc:desc="Oscillator Bypass" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect. Clock selection depends on XTALSEL value." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CDPSWITCH" edc:desc="Cache Data SRAM Power Switch" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The cache data SRAM is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The cache data SRAM is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CTPSWITCH" edc:desc="Cache Tag SRAM Power Switch" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The cache tag SRAM is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The cache tag SRAM is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ONEA" edc:desc="This bit must always be set to 1." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Password Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E141C" edc:access="-------------nnn-nnn----nnn-nnn-" edc:cname="SUPC_WUMR" edc:impl="0x770EE" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="Supply Monitor Wake-up Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The supply monitor detection has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The supply monitor detection forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTTEN" edc:desc="Real-time Timer Wake-up Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTT alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTCEN" edc:desc="Real-time Clock Wake-up Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTC alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN0" edc:desc="Low-power Debouncer Enable WKUP0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP0 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP0 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCEN1" edc:desc="Low-power Debouncer Enable WKUP1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP1 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP1 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCCLR" edc:desc="Low-power Debouncer Clear" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="A low-power debounce event does not create an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WKUPDBC" edc:desc="Wake-up Inputs Debouncer Period" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="IMMEDIATE" edc:desc="Immediate, no debouncing, detected active at least on one Slow Clock edge." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_3_SCLK" edc:desc="WKUPx shall be in its active state for at least 3 SLCK periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_SCLK" edc:desc="WKUPx shall be in its active state for at least 32 SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_512_SCLK" edc:desc="WKUPx shall be in its active state for at least 512 SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_4096_SCLK" edc:desc="WKUPx shall be in its active state for at least 4,096 SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32768_SCLK" edc:desc="WKUPx shall be in its active state for at least 32,768 SLCK periods" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBC" edc:desc="Low-power Debouncer Period" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 2 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 3 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 4 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 5 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 6 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 7 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 8 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
