Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0x400E1424" edc:access="rrrrrrrrrrrrrrrr-rr-----rrrrr-r-" edc:cname="SUPC_SR" edc:impl="0xFFFF60FA" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPS" edc:desc="WKUP Wake-up Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BODRSTS" edc:desc="Brownout Detector Reset Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No core brownout rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMRSTS" edc:desc="Supply Monitor Reset Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMS" edc:desc="Supply Monitor Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMOS" edc:desc="Supply Monitor Output Status" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="The supply monitor detected VDDIO higher than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="The supply monitor detected VDDIO lower than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OSCSEL" edc:desc="32-kHz Oscillator Selection Status" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The slow clock SLCK is generated by the embedded 32 kHz RC oscillator." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRYST" edc:desc="The slow clock SLCK is generated by the 32 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LPDBCS0" edc:desc="Low-power Debouncer Wake-up Status on WKUP0 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCS1" edc:desc="Low-power Debouncer Wake-up Status on WKUP1 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPIS0" edc:desc="WKUP Input Status 0 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS1" edc:desc="WKUP Input Status 1 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS2" edc:desc="WKUP Input Status 2 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS3" edc:desc="WKUP Input Status 3 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS4" edc:desc="WKUP Input Status 4 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS5" edc:desc="WKUP Input Status 5 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS6" edc:desc="WKUP Input Status 6 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS7" edc:desc="WKUP Input Status 7 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS8" edc:desc="WKUP Input Status 8 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS9" edc:desc="WKUP Input Status 9 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS10" edc:desc="WKUP Input Status 10 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS11" edc:desc="WKUP Input Status 11 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS12" edc:desc="WKUP Input Status 12 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS13" edc:desc="WKUP Input Status 13 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS14" edc:desc="WKUP Input Status 14 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS15" edc:desc="WKUP Input Status 15 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
