Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:AdjustPoint edc:_addr="0x400E1428" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E142C" edc:access="nnnnnnnnnnnnnnnn---nnnnnn--nnnnn" edc:cname="SUPC_PWMR" edc:impl="0xFFFF1F9F" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LPOWERS" edc:desc="Low Power Value Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FACTORY" edc:desc="The trimming value applied to the regulator when the device is in Wait mode. This value is factory-defined." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER" edc:desc="The trimming value applied to the regulator is defined by the value programmed in the LPOWERx bits." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPOWER0" edc:desc="Low Power Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPOWER1" edc:desc="Low Power Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPOWER2" edc:desc="Low Power Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPOWER3" edc:desc="Low Power Value" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="STUPTIME" edc:desc="Start-up Time when Resuming from Wait Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FAST" edc:desc="Fast start-up." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SLOW" edc:desc="Slow start-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ECPWRS" edc:desc="Enhanced Custom Power Value Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FACTORY" edc:desc="The trimming value applied to the regulator when the device is in Active mode. This value is factory-defined." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER" edc:desc="The trimming value applied to the regulator is defined by the value programmed in ECPWRx bits." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ECPWR0" edc:desc="Enhanced Custom Power Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECPWR1" edc:desc="Enhanced Custom Power Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECPWR2" edc:desc="Enhanced Custom Power Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECPWR3" edc:desc="Enhanced Custom Power Value" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SRAM0ON" edc:desc="SRAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM1ON" edc:desc="SRAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM2ON" edc:desc="SRAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM3ON" edc:desc="SRAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM4ON" edc:desc="SRAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM5ON" edc:desc="SRAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM6ON" edc:desc="SRAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPRAMON" edc:desc="Dual-port RAM Power Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="USB dual-port RAM is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="USB dual-port RAM is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Password Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1430" edc:access="-------n-nnn-nnnnnnnnnnnnnnnnnnn" edc:cname="RTT_MR" edc:impl="0x177FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="RTPRES" edc:desc="Real-time Timer Prescaler Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="ALMIEN" edc:desc="Alarm Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTINCIEN" edc:desc="Real-time Timer Increment Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTRST" edc:desc="Real-time Timer Restart" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTDIS" edc:desc="Real-time Timer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INC2AEN" edc:desc="RTTINC2 Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVAEN" edc:desc="Trigger Event Alarm Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC1HZ" edc:desc="Real-Time Clock 1Hz Clock Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1434" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RTT_AR" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMV" edc:desc="Alarm Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1438" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RTT_VR" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="CRTV" edc:desc="Current Real-time Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E143C" edc:access="-----------------------------rrr" edc:cname="RTT_SR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMS" edc:desc="Real-time Alarm Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTINC" edc:desc="Prescaler Roll-over Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTINC2" edc:desc="Predefined Number of Prescaler Roll-over Status (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1440" edc:access="---------------------nnn-----nnn" edc:cname="RTT_MODR" edc:impl="0x707" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="SELINC2" edc:desc="Selection of the 32-bit Counter Modulo to generate RTTINC2 flag" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_RTTINC2" edc:desc="The RTTINC2 flag never rises" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MOD64" edc:desc="The RTTINC2 flag is set when CRTV modulo 64 equals 0" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MOD128" edc:desc="The RTTINC2 flag is set when CRTV modulo 128 equals 0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MOD256" edc:desc="The RTTINC2 flag is set when CRTV modulo 256 equals 0" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MOD512" edc:desc="The RTTINC2 flag is set when CRTV modulo 512 equals 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MOD1024" edc:desc="The RTTINC2 flag is set when CRTV modulo 1024 equals 0.Example: If RTPRES=32 then RTTINC2 flag rises once per second if the slow clock is 32.768 kHz." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="MOD2048" edc:desc="The RTTINC2 flag is set when CRTV modulo 2048 equals 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="MOD4096" edc:desc="The RTTINC2 flag is set when CRTV modulo 4096 equals 0" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SELTRGEV" edc:desc="Selection of the 32-bit Counter Modulo to generate the trigger event" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_EVENT" edc:desc="No event generated" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MOD2" edc:desc="Event occurs when CRTV modulo 2 equals 0" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MOD4" edc:desc="Event occurs when CRTV modulo 4 equals 0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MOD8" edc:desc="Event occurs when CRTV modulo 8 equals 0" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MOD16" edc:desc="Event occurs when CRTV modulo 16 equals 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MOD32" edc:desc="Event occurs when CRTV modulo 32 equals 0" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="MOD64" edc:desc="Event occurs when CRTV modulo 64 equals 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="MOD128" edc:desc="Event occurs when CRTV modulo 128 equals 0" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
