Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg55/edc/ATSAMG55G19.PIC
      <edc:SFRDef edc:_addr="0xE000ED9C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_RBAR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="MPU region field." edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="MPU Region Number valid bit." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Region base address field." edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA0" edc:access="---n-nnn--nnnnnnnnnnnnnn--nnnnnn" edc:cname="MPU_RASR" edc:impl="0x173FFF3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Region enable bit." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Specifies the size of the MPU protection region." edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:desc="Subregion disable bits." edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="B" edc:desc="MPU access permission attributes." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="MPU access permission attributes." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="Shareable bit." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:desc="MPU access permission attributes." edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access permission field." edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Instruction access disable bit." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EDA4" edc:offset="0x15C"/>
      <edc:SFRDef edc:_addr="0xE000EF00" edc:access="-----------------------nnnnnnnnn" edc:cname="NVICSTIR" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="INTID" edc:desc="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3." edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:CodeSector atdf:pagesize="0x200" edc:beginaddr="0x400000" edc:endaddr="0x480000" edc:regionid="IFLASH"/>
    <edc:BootConfigSector edc:beginaddr="0x800000" edc:endaddr="0xC00000" edc:regionid="IROM"/>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20028000" edc:isexecutable="true" edc:regionid="IRAM"/>
    <edc:DeviceIDSector edc:beginaddr="0x400E0740" edc:endaddr="0x400E0744" edc:mask="0xFFFFFFE0" edc:regionid="devid" edc:value="0x24470AE0"/>
    <edc:EmulatorSector edc:beginaddr="0xE0001000" edc:endaddr="0xE000F000" edc:regionid="emulation"/>
  </edc:PhysicalSpace>
  <edc:FusesSpace edc:magicoffset="0xD0000000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="------nn" edc:cname="GPNVMBITS" edc:factorydefault="0x0" edc:impl="0x3" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="SECURITY_BIT" edc:desc="Security Bit" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOOT_MODE" edc:desc="Boot Mode Selection" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0xD0000004">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x8" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD0" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_0" edc:desc="Lock Region 0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_1" edc:desc="Lock Region 1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_2" edc:desc="Lock Region 2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_3" edc:desc="Lock Region 3" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_4" edc:desc="Lock Region 4" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_5" edc:desc="Lock Region 5" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_6" edc:desc="Lock Region 6" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_7" edc:desc="Lock Region 7" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_8" edc:desc="Lock Region 8" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_9" edc:desc="Lock Region 9" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_10" edc:desc="Lock Region 10" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_11" edc:desc="Lock Region 11" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_12" edc:desc="Lock Region 12" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_13" edc:desc="Lock Region 13" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_14" edc:desc="Lock Region 14" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_15" edc:desc="Lock Region 15" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_16" edc:desc="Lock Region 16" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_17" edc:desc="Lock Region 17" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_18" edc:desc="Lock Region 18" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_19" edc:desc="Lock Region 19" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_20" edc:desc="Lock Region 20" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_21" edc:desc="Lock Region 21" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_22" edc:desc="Lock Region 22" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_23" edc:desc="Lock Region 23" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_24" edc:desc="Lock Region 24" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_25" edc:desc="Lock Region 25" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_26" edc:desc="Lock Region 26" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_27" edc:desc="Lock Region 27" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_28" edc:desc="Lock Region 28" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_29" edc:desc="Lock Region 29" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_30" edc:desc="Lock Region 30" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_31" edc:desc="Lock Region 31" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
